Repository: david-acm/beepKeyboard
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: fr

source: Beep for uppercases when &caps lock is on
fr: Bip pour les majuscules quand le &verrouillage majuscule est activé

source: Beep for typed characters when &shift is pressed
fr: Bip pour les caractères saisis lorsque vous appuyez sur la touche &maj

source: Beep for &toggle keys changes
fr: Bip pendant le changement de l'état des &touches de l'interrupteur à bascule

source: &Announce toggle keys changes (if Beep for toggle keys changes is disabled NVDA will have the original behavior)
fr: &Annoncer le changement de l'état des touches de l'interrupteur à bascule (si l'option "Bip pendant le changement de l'état des touches de l'interrupteur à bascule" est désactivé, NVDA aura le comportement d'origine)

source: &disable beeping on password fields
fr: &Désactiver le bip des champs de mot de passe

source: &Open advanced options
fr: &Ouvrir les options avancées

source: Advanced settings - Keyboard beep
fr: Paramètres avancés - Keyboard beep

source: &Ignored characters with shift pressed
fr: &Ignorés les caractères saisis avec la touche maj enfoncée

source: Beep &always for the following characters
fr: Bip &toujours pour les caractères suivants

source: &Select tone to configure
fr: &Choisir la tonalité à configurer

source: Typed characters with shift pressed
fr: Caractères saisis avec la touche maj enfoncée

source: Custom characters
fr: Caractères personnalisés

source: Typed characters when caps lock is on
fr: Caractères saisis quand le verrouillage majuscule est activé

source: Toggle key goes off
fr: Désactivée une touche de l'interrupteur à bascule

source: Toggle key goes on
fr: Activée une touche de l'interrupteur à bascule

source: Tone &pitch
fr: &Hauteur

source: Tone &length
fr: &Durée

source: Tone &volume
fr: &Volume

source: &Test tone
fr: &Tester la tonalité

source: You entered a wrong value. Please correct it or discard changes.
fr: Vous avez entré une mauvaise valeur. Veuillez le corriger ou écarter les modifications.

source: This add-on beeps with some keyboard events.
fr: Cette extension dit à NVDA d'émettre des bips avec certains événements du clavier.
